// 35. Написать программу замены элементов массива на противоположные

int[] a = { 1, 2, 3, 4, 5, 6, 7, 8, 9 };
foreach (int el in a)
    System.Console.Write($"{el * -1} ");

// Что значит "на притовоположные?" Я так понял для 1 противоположное -1